{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"kernel_constraint": null, "batch_input_shape": [null, 2500], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "trainable": true, "name": "dense_1", "kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "activity_regularizer": null, "units": 2500, "use_bias": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "trainable": true, "name": "dense_2", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "activity_regularizer": null, "units": 6, "use_bias": true}}], "keras_version": "2.2.2", "backend": "tensorflow"}